Revit 2024 API
OpeningWrappingCondition Enumeration
 Used by CompoundStructure to describe which shell layers participate in wrapping at openings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public enum OpeningWrappingCondition
Visual Basic
Public Enumeration OpeningWrappingCondition
Visual C++
public enum class OpeningWrappingCondition
Members
Member name | Description
None |  None of the shell layers participate in wrapping at openings.
Exterior |  Only the exterior shell layers participate in wrapping at openings.
Interior |  Only the interior shell layers participate in wrapping at openings.
ExteriorAndInterior |  Both interior and exterior shell layers participate in wrapping at openings.
See Also
Autodesk.Revit.DB Namespace